package com.moutum.equ.service;

import java.util.List;
import java.util.Map;

import com.moutum.equ.domain.Type;
import com.moutum.equ.dto.PageBean;

/************************************************************************************
 * @Title        : TypeService.java
 * @Description : 
 * @Author       : BianWeiqing
 * @DateTime     : 2015年3月25日 上午11:42:25
 * @Copyright    : 2015 Moutum All Rights Reserved
 * @version      : V1.0
 ************************************************************************************/
public interface TypeService
{
    /********************************************************************************
     * 根据查询条件获取PageBean
     * @param pageNum
     * @param pageSize
     * @param map
     * @return
     ********************************************************************************/
    PageBean getPage(int pageNum, int pageSize, Map<String, Object> map);
    
    /********************************************************************************
     * 添加物品类型
     * @param type
     * @return 1:成功，0:类型重复, -1:操作失败
     ********************************************************************************/
    int save(Type type);
    
    /********************************************************************************
     * 删除物品类型
     * @param type
     * @return 1:成功，0:类型不存在, -1:操作失败
     ********************************************************************************/
    int delete(int id);
    
    /********************************************************************************
     * 修改物品类型
     * @param type
     * @return 1:成功，0:类型不存在, -1:操作失败
     ********************************************************************************/
    int modify(Type type);

    /********************************************************************************
     * 获取所有类型信息
     * @return
     ********************************************************************************/
    List<Type> findAll();
 
    /********************************************************************************
     * 根据ID查询类型对象
     * @param id
     * @return
     ********************************************************************************/
    Type getById(long id);
}

