package com.moutum.equ.service;

import java.util.Map;

import com.moutum.equ.domain.User;
import com.moutum.equ.dto.PageBean;

/************************************************************************************
 * @Title        : UserService.java
 * @Description : 
 * @Author       : BianWeiqing
 * @DateTime     : 2015年3月9日 下午4:03:30
 * @Copyright    : 2015 Moutum All Rights Reserved
 * @version      : V1.0
 ************************************************************************************/
public interface UserService
{
    /********************************************************************************
     * 检测用户是否有执行方法的权限
     * @param user
     * @param function：方法名
     * @return
     ********************************************************************************/
    boolean haveRight(User user, String function);
    
    /********************************************************************************
     * 根据查询条件获取PageBean
     * @param pageNum
     * @param pageSize
     * @param map
     * @return
     ********************************************************************************/
    PageBean getPage(int pageNum, int pageSize, Map<String, Object> map);

    /********************************************************************************
     * 添加用户
     * @param user
     * @return 1:成功，0:用户名重复, -1:失败
     ********************************************************************************/
    int save(User user);

    /********************************************************************************
     * 编辑用户
     * @param user
     * @return 1:成功，0:用户不存在，-1:操作失败
     ********************************************************************************/
    int modify(User user);

    /********************************************************************************
     * 根据账户查询用户
     * @param loginAccount
     * @return
     ********************************************************************************/
    User select(String loginAccount);

    /********************************************************************************
     * 删除用户
     * @param user
     * @return 1:成功，0:用户不存在，-1:操作失败
     ********************************************************************************/
    int deleteUser(String loginAccount);

    /********************************************************************************
     * 根据账户ID查询用户
     * @param userId
     * @return
     ********************************************************************************/
    User selectById(long userId);
}